## Teacher Data Analysis with SQL

In [1]:
import pandas as pd
import numpy as np
import mysql.connector as sq

In [2]:
df = pd.read_csv("teachers.csv", low_memory=False)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100005 entries, 0 to 100004
Data columns (total 16 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   id                   99998 non-null   float64
 1   last_name            100003 non-null  object
 2   first_name           100003 non-null  object
 3   county               100003 non-null  object
 4   district             100003 non-null  object
 5   school               100003 non-null  object
 6   primary_job          100003 non-null  object
 7   fte                  100003 non-null  object
 8   salary               99983 non-null   object
 9   certificate          100003 non-null  object
 10  subcategory          100003 non-null  object
 11  teaching_route       100003 non-null  object
 12  highly_qualified     100003 non-null  object
 13  experience_district  100003 non-null  object
 14  experience_nj        100003 non-null  object
 15  experience_total     99983 non-null   object
dtypes: float64(1), object(15)
memory usage: 12.2+ MB

In [3]:
df.dropna(how="all", inplace=True)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 100003 entries, 0 to 100004
Data columns (total 16 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   id                   99998 non-null   float64
 1   last_name            100003 non-null  object
 2   first_name           100003 non-null  object
 3   county               100003 non-null  object
 4   district             100003 non-null  object
 5   school               100003 non-null  object
 6   primary_job          100003 non-null  object
 7   fte                  100003 non-null  object
 8   salary               99983 non-null   object
 9   certificate          100003 non-null  object
 10  subcategory          100003 non-null  object
 11  teaching_route       100003 non-null  object
 12  highly_qualified     100003 non-null  object
 13  experience_district  100003 non-null  object
 14  experience_nj        100003 non-null  object
 15  experience_total     99983 non-null   object
dtypes: float64(1), object(15)
memory usage: 13.0+ MB

In [5]:
# identify numerical columns excluding id, remove invalid chars and set to np.nan
numerical_cols = ['fte', 'experience_district', 'experience_nj', 'salary', 'experience_total']
df[numerical_cols] = df[numerical_cols].replace(r'[^0-9\.]+', np.nan, regex=True)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 100003 entries, 0 to 100004
Data columns (total 16 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   id                   99998 non-null   float64
 1   last_name            100003 non-null  object
 2   first_name           100003 non-null  object
 3   county               100003 non-null  object
 4   district             100003 non-null  object
 5   school               100003 non-null  object
 6   primary_job          100003 non-null  object
 7   fte                  100002 non-null  object
 8   salary               99981 non-null   object
 9   certificate          100003 non-null  object
 10  subcategory          100003 non-null  object
 11  teaching_route       100003 non-null  object
 12  highly_qualified     100003 non-null  object
 13  experience_district  100001 non-null  object
 14  experience_nj        100002 non-null  object
 15  experience_total     99981 non-null   object
dtypes: float64(1), object(15)
memory usage: 13.0+ MB

In [7]:
#drop rows containing nan
df.dropna(inplace=True)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 99954 entries, 0 to 100004
Data columns (total 16 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   id                   99954 non-null  float64
 1   last_name            99954 non-null  object
 2   first_name           99954 non-null  object
 3   county               99954 non-null  object
 4   district             99954 non-null  object
 5   school               99954 non-null  object
 6   primary_job          99954 non-null  object
 7   fte                  99954 non-null  object
 8   salary               99954 non-null  object
 9   certificate          99954 non-null  object
 10  subcategory          99954 non-null  object
 11  teaching_route       99954 non-null  object
 12  highly_qualified     99954 non-null  object
 13  experience_district  99954 non-null  object
 14  experience_nj        99954 non-null  object
 15  experience_total     99954 non-null  object
dtypes: float64(1), object(15)
memory usage: 13.0+ MB

In [9]:
# set correct datatype and change vals to numeric
df['fte'] = pd.to_numeric(df['fte'], errors='coerce')
df['experience_district'] = pd.to_numeric(df['experience_district'], errors='coerce')
df['experience_nj'] = pd.to_numeric(df['experience_nj'], errors='coerce')
df['salary'] = pd.to_numeric(df['salary'], errors='coerce')
df['experience_total'] = pd.to_numeric(df['experience_total'], errors='coerce')

In [10]:
#check types
df.dtypes

id                     float64
last_name               object
first_name              object
county                  object
district                object
school                  object
primary_job             object
fte                    float64
salary                 float64
certificate             object
subcategory             object
teaching_route          object
highly_qualified        object
experience_district    float64
experience_nj          float64
experience_total       float64
dtype: object

In [11]:
#check id column for invalid characters
df['id'] = df['id'].replace(r'[^0-9\.]+', np.nan, regex=True)

In [12]:
# set correct datatype and change vals to numeric
df['id'] = pd.to_numeric(df['id'], errors='coerce')

In [13]:
df.dtypes

id                     float64
last_name               object
first_name              object
county                  object
district                object
school                  object
primary_job             object
fte                    float64
salary                 float64
certificate             object
subcategory             object
teaching_route          object
highly_qualified        object
experience_district    float64
experience_nj          float64
experience_total       float64
dtype: object

In [14]:
#Set the correct id number for rows that are NA/NaN, get max id and sum of ids
max_id = df['id'].max()

# confirm max_id is numeric
if pd.isna(max_id):
    max_id = 0
else:
    max_id = int(max_id)

# create new IDs for rows with NaN
nan_ids = df['id'].isna().sum()

# confirm nan_ids is numeric
if not isinstance(nan_ids, int):
    nan_ids = int(nan_ids)

# assign IDs starting from max_id + 1
new_ids = range(max_id + 1, max_id + 1 + nan_ids)
df.loc[df['id'].isna(), 'id'] = new_ids

# Identify rows that were modified
modified_rows = df.loc[df['id'].isin(new_ids)]

# show modified rows
print("DataFrame with modified ID rows:")
print(modified_rows)

DataFrame with modified ID rows:
Empty DataFrame
Columns: [id, last_name, first_name, county, district, school, primary_job, fte, salary, certificate, subcategory, teaching_route, highly_qualified, experience_district, experience_nj, experience_total]
Index: []

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 99954 entries, 0 to 100004
Data columns (total 16 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   id                   99954 non-null  float64
 1   last_name            99954 non-null  object
 2   first_name           99954 non-null  object
 3   county               99954 non-null  object
 4   district             99954 non-null  object
 5   school               99954 non-null  object
 6   primary_job          99954 non-null  object
 7   fte                  99954 non-null  float64
 8   salary               99954 non-null  float64
 9   certificate          99954 non-null  object
 10  subcategory          99954 non-null  object
 11  teaching_route       99954 non-null  object
 12  highly_qualified     99954 non-null  object
 13  experience_district  99954 non-null  float64
 14  experience_nj        99954 non-null  float64
 15  experience_total     99954 non-null  float64
dtypes: float64(6), object(10)
memory usage: 13.0+ MB

In [16]:
#identify string columns
string_columns = df.select_dtypes(include=['object']).columns.tolist()
print(string_columns)

['last_name', 'first_name', 'county', 'district', 'school', 'primary_job', 'certificate', 'subcategory', 'teaching_route', 'highly_qualified']

In [17]:
#remove any leading and trailing spaces
df[string_columns] = df[string_columns].apply(lambda x: x.str.strip())

In [18]:
# make a copy of the df
df_copy = df.copy()

In [19]:
#show examples of modified data
modified_rows = df_copy[~df[string_columns].eq(modified_rows[string_columns]).all(axis=1)]
modified_rows.head()

,id,last_name,first_name,county,district,school,primary_job,fte,salary,certificate,subcategory,teaching_route,highly_qualified,experience_district,experience_nj,experience_total
0,1.0,Heckman,William,Bergen,River Edge Boro,Cherry Hill School,Elementary School Teacher K-5,1.0,98774.0,Standard certificate,General ed,Traditional,Not highly qualified,9.0,9.0,9.0
1,2.0,Bird,Kelly,Bergen,Wood-ridge Boro,Catherine E. Doyle Elementary School,Art,1.0,118415.0,Standard certificate,General ed,Traditional,Doesnt need to be highly qualified,13.0,13.0,13.0
2,3.0,Aikens,Crystal A,Bergen,Emerson Boro,Patrick M Villano School,Kindergarten,1.0,57919.0,Standard certificate,General ed,Alternate,Doesnt need to be highly qualified,7.0,7.0,7.0
3,4.0,Leonard,Isaiah,Gloucester,Deptford Twp,Deptford Township High School,Elementary Kindergraten-8 Grade,0.8,107746.0,CEAS,Special ed,Traditional,Doesn't need to be highly qualified,26.0,26.0,26.0
4,5.0,Hinton,Dustin,Camden,Cherry Hill Twp,Cherry Hill High School West,English Non-elementary,0.8,54277.0,Standard certificate,General ed,Traditional,Doesn't need to be highly qualified,5.0,5.0,5.0

In [20]:
import re

In [21]:
# Define a regex pattern for valid characters
valid_chars_pattern = re.compile(r"[^a-zA-Z0-9 ,\.\?!&/\(\)\-:_'#@]")

In [22]:
# Function to remove invalid characters using regex
def remove_invalid_chars(text):
    if pd.isna(text):
        return text
    return valid_chars_pattern.sub('', text)

In [23]:
# remove invalid characters from string columns
df[string_columns] = df[string_columns].map(remove_invalid_chars)

In [24]:
#make a copy of the dataframe
df_copy = df.copy()

In [25]:
#Show examples of modified rows
modified_string_rows = df.loc[~df[string_columns].eq(df_copy[string_columns]).all(axis=1)]
df_modified_string_rows = modified_string_rows.copy()
df_modified_string_rows.head()

Empty DataFrame
Columns: [id, last_name, first_name, county, district, school, primary_job, fte, salary, certificate, subcategory, teaching_route, highly_qualified, experience_district, experience_nj, experience_total]
Index: []

In [26]:
df.drop_duplicates()

,id,last_name,first_name,county,district,school,primary_job,fte,salary,certificate,subcategory,teaching_route,highly_qualified,experience_district,experience_nj,experience_total
0,1.0,Heckman,William,Bergen,River Edge Boro,Cherry Hill School,Elementary School Teacher K-5,1.0,98774.0,Standard certificate,General ed,Traditional,Not highly qualified,9.0,9.0,9.0
1,2.0,Bird,Kelly,Bergen,Wood-ridge Boro,Catherine E. Doyle Elementary School,Art,1.0,118415.0,Standard certificate,General ed,Traditional,Doesnt need to be highly qualified,13.0,13.0,13.0
2,3.0,Aikens,Crystal A,Bergen,Emerson Boro,Patrick M Villano School,Kindergarten,1.0,57919.0,Standard certificate,General ed,Alternate,Doesnt need to be highly qualified,7.0,7.0,7.0
3,4.0,Leonard,Isaiah,Gloucester,Deptford Twp,Deptford Township High School,Elementary Kindergraten-8 Grade,0.8,107746.0,CEAS,Special ed,Traditional,Doesn't need to be highly qualified,26.0,26.0,26.0
4,5.0,Hinton,Dustin,Camden,Cherry Hill Twp,Cherry Hill High School West,English Non-elementary,0.8,54277.0,Standard certificate,General ed,Traditional,Doesn't need to be highly qualified,5.0,5.0,5.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
100000,99999.0,Anderson,Jonathan,Morris,Dover Town,Dover High School,Kindergarten,1.0,102299.0,CEAS,Special ed,Traditional,Not highly qualified,21.0,39.0,37.0
100001,100000.0,Pearson,Frederick,Hudson,Weehawken Twp,Daniel Webster School,Health,0.8,81530.0,CEAS,Special ed,Alternate,Not highly qualified,25.0,17.0,29.0
100002,100001.0,Lin,Thomas,Essex,Newark City,Harriet Tubman Elementary School,Computer Literacy/applications/programming,1.0,96865.0,CEAS,Special ed,Traditional,Doesn't need to be highly qualified,11.0,11.0,32.0
100003,100002.0,Perez,Christopher,Bergen,Hackensack City,Hackensack High School,Preschool,0.5,93969.0,CEAS,Special ed,Traditional,Not highly qualified,34.0,10.0,38.0
100004,100003.0,Wilkerson,Bruce,Middlesex,New Brunswick City,New Brunswick High School,Mathematics Grades 5 - 8,1.0,108523.0,CEAS,Special ed,Traditional,Not highly qualified,8.0,25.0,16.0

In [27]:
df.to_csv("cleaned_data.csv", index=False)

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 99954 entries, 0 to 100004
Data columns (total 16 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   id                   99954 non-null  float64
 1   last_name            99954 non-null  object
 2   first_name           99954 non-null  object
 3   county               99954 non-null  object
 4   district             99954 non-null  object
 5   school               99954 non-null  object
 6   primary_job          99954 non-null  object
 7   fte                  99954 non-null  float64
 8   salary               99954 non-null  float64
 9   certificate          99954 non-null  object
 10  subcategory          99954 non-null  object
 11  teaching_route       99954 non-null  object
 12  highly_qualified     99954 non-null  object
 13  experience_district  99954 non-null  float64
 14  experience_nj        99954 non-null  float64
 15  experience_total     99954 non-null  float64
dtypes: float64(6), object(10)
memory usage: 13.0+ MB

In [29]:
#import libraries
import mysql.connector as sq

mysql_db = sq.connect(host="127.0.0.1", user="root", passwd="", buffered=True)
mycursor = mysql_db.cursor()

ProgrammingError: 1045 (28000): Access denied for user 'root'@'localhost' (using password: NO)

In [ ]:
mycursor.execute("SHOW DATABASES")

In [ ]:
for db in mycursor:
    print(db)

In [ ]:
# mycursor.execute("USE teachers")

In [ ]:
# mycursor.execute("DROP TABLE teachers_info")

In [ ]:
mycursor.execute("CREATE TABLE teachers.teachers_info(id FLOAT NOT NULL, last_name VARCHAR(200) NOT NULL, \
first_name VARCHAR(200) NOT NULL, county VARCHAR(200) NOT NULL, district VARCHAR(200) NOT NULL, school VARCHAR(200) NOT NULL, \
primary_job VARCHAR(200) NOT NULL, fte FLOAT NOT NULL, salary FLOAT NOT NULL, certificate VARCHAR(200) NOT NULL, \
subcategory VARCHAR(200) NOT NULL, teaching_route VARCHAR(200) NOT NULL, highly_qualified VARCHAR(200) NOT NULL, \
experience_district FLOAT NOT NULL, experience_nj FLOAT NOT NULL, experience_total FLOAT NOT NULL, PRIMARY KEY (id))")

In [ ]:
mycursor.execute("USE teachers")

In [ ]:
mycursor.execute("SHOW TABLES")

In [ ]:
for table in mycursor:
    print(table)

In [ ]:
SQLCMD = """
LOAD DATA INFILE '/Users/feliciadogarro/cnf/cleaned_data.csv'
INTO TABLE teachers.teachers_info
FIELDS TERMINATED BY ','
OPTIONALLY ENCLOSED BY '"'
LINES TERMINATED BY '\\n'
IGNORE 1 ROWS
(id, last_name, first_name, county, district, school, primary_job, @fte, @salary, certificate, subcategory, teaching_route, highly_qualified, @experience_district, @experience_nj, @experience_total)
SET 
    fte = IF(@fte = '' OR @fte IS NULL, 0, @fte),
    salary = IF(@salary = '' OR @salary IS NULL, 0, @salary),
    experience_district = IF(@experience_district = '' OR @experience_district IS NULL, 0, @experience_district),
    experience_nj = IF(@experience_nj = '' OR @experience_nj IS NULL, 0, @experience_nj),
    experience_total = IF(@experience_total = '' OR @experience_total IS NULL, 0, @experience_total);
"""

mycursor.execute(SQLCMD)

In [ ]:
mysql_db.commit()

In [ ]:
cmd = "select count(*) from \
                 teachers.teachers_info"
mycursor.execute(cmd)
count = mycursor.fetchone()[0]

print(f"Number of rows in teachers_salaries table : {count}")

In [ ]:
cmd = """SELECT COUNT(*) \
                FROM INFORMATION_SCHEMA.COLUMNS \
                WHERE table_schema = 'teachers' \
                AND table_name = 'teachers_info'"""
mycursor.execute(cmd)
count = mycursor.fetchone()[0]
print(f"Number of columns in teachers_salaries table : {count}")

In [ ]:
sample_df = pd.read_csv("/Users/feliciadogarro/cnf/sample.csv")

In [ ]:
sample_df.head()

In [ ]:
sample_df.tail()

In [ ]:
sample_df.shape